DebtManagment/src/Catalogs/ДоговорыКонтрагентов/ДоговорыКонтрагентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ДоговорыКонтрагентов</name>
  <owners>Catalog.Контрагенты</owners>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипДоговора</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УчитыватьНДС</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЦенаВключаетНДС</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатусДействия</name>
    <type>
      <types>EnumRef.СтатусыРаботыСДолгом</types>
    </type>
  </attributes>
  <attributes>
    <name>СрокДействияДоговора</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончанияДоговора</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаДоговора</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерДоговора</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НаличиеПролонгации</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Catalog>

DebtManagment/src/Enums/ТипыЗагруженныхДокументов/ТипыЗагруженныхДокументов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыЗагруженныхДокументов</name>
  <enumValues>
    <name>Оригинал</name>
  </enumValues>
  <enumValues>
    <name>СканВерсия</name>
  </enumValues>
  <enumValues>
    <name>Проект</name>
  </enumValues>
</mdclass:Enum>

DebtManagment/src/Enums/ВидыЗагруженныхДокументов/ВидыЗагруженныхДокументов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыЗагруженныхДокументов</name>
  <enumValues>
    <name>Договор</name>
  </enumValues>
  <enumValues>
    <name>ДополнительноеСоглашение</name>
  </enumValues>
</mdclass:Enum>

DebtManagment/src/Documents/РеестрДолжников/РеестрДолжников.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>РеестрДолжников</name>
  <registerRecords>InformationRegister.СтатусыРаботыСДолгом</registerRecords>
  <registerRecords>InformationRegister.ДолгиДолжников</registerRecords>
  <registerRecords>AccumulationRegister.ОстаткиДолгов</registerRecords>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтатусРаботыСДолгом</name>
    <type>
      <types>EnumRef.СтатусыРаботыСДолгом</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Должники</name>
    <attributes>
      <name>Должник</name>
      <type>
        <types>CatalogRef.Должники</types>
      </type>
    </attributes>
    <attributes>
      <name>Долг</name>
      <type>
        <types>CatalogRef.Долги</types>
      </type>
    </attributes>
    <attributes>
      <name>СтатусДолжника</name>
      <type>
        <types>EnumRef.СтатусыДолжника</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаЗадолженности</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

DebtManagment/src/Catalogs/ДоговорыКонтрагентовПрисоединенныеФайлы/ДоговорыКонтрагентовПрисоединенныеФайлы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ДоговорыКонтрагентовПрисоединенныеФайлы</name>
  <attributes>
    <name>Автор</name>
    <comment>Автор - пользователь, добавивший файл</comment>
    <type>
      <types>CatalogRef.УчетныеЗаписиСинхронизацииФайлов</types>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ВладелецФайла</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаМодификацииУниверсальная</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСоздания</name>
    <comment>Дата добавления файла в базу</comment>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Зашифрован</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Изменил</name>
    <comment>Автор - пользователь, добавивший файл</comment>
    <type>
      <types>CatalogRef.УчетныеЗаписиСинхронизацииФайлов</types>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ИндексКартинки</name>
    <comment>Индекс иконки, соответствующей расширению файла, для показа в списке</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Описание</name>
    <comment>Описание файла</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПодписанЭП</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПутьКФайлу</name>
    <comment>Дополнительный путь к файлу на диске (в случае если ТипХраненияФайла - на диске)</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Размер</name>
    <comment>Размер файла</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Расширение</name>
    <comment>Расширение файла версии</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Редактирует</name>
    <comment>Пользователь, занявший файл для редактирования</comment>
    <type>
      <types>CatalogRef.УчетныеЗаписиСинхронизацииФайлов</types>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатусИзвлеченияТекста</name>
    <type>
      <types>EnumRef.СтатусыИзвлеченияТекстаФайлов</types>
    </type>
  </attributes>
  <attributes>
    <name>ТекстХранилище</name>
    <comment>Текст, извлеченный из файла - для полнотекстового поиска</comment>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипХраненияФайла</name>
    <comment>Где хранятся файлы - в базе как ХранилищеЗначения или в каталоге на диске</comment>
    <type>
      <types>EnumRef.ТипыХраненияФайлов</types>
    </type>
  </attributes>
  <attributes>
    <name>Том</name>
    <comment>Ссылка на том (в случае если ТипХраненияФайла - на диске)</comment>
    <type>
      <types>CatalogRef.ТомаХраненияФайлов</types>
    </type>
  </attributes>
  <attributes>
    <name>ФайлХранилище</name>
    <comment>Служебное поле для обмена файлами в РИБ</comment>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаЗаема</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ХранитьВерсии</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипЗагруженногоДокумента</name>
    <type>
      <types>EnumRef.ТипыЗагруженныхДокументов</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидЗагруженногоДокумента</name>
    <type>
      <types>EnumRef.ВидыЗагруженныхДокументов</types>
    </type>
  </attributes>
  <tabularSections>
    <name>УдалитьЭлектронныеПодписи</name>
    <attributes>
      <name>ДатаПодписи</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>ИмяФайлаПодписи</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>260</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Комментарий</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>КомуВыданСертификат</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Отпечаток</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>255</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Подпись</name>
      <type>
        <types>ValueStorage</types>
      </type>
    </attributes>
    <attributes>
      <name>УстановившийПодпись</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>Сертификат</name>
      <comment>Двоичные данные сертификата</comment>
      <type>
        <types>ValueStorage</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаПроверкиПодписи</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>ПодписьВерна</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>УдалитьСертификатыШифрования</name>
    <attributes>
      <name>Отпечаток</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>255</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Представление</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Сертификат</name>
      <comment>Двоичные данные сертификата</comment>
      <type>
        <types>ValueStorage</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

DebtManagment/src/Catalogs/ДоговорыКонтрагентов/Forms/ФормаСписка/Module.bsl
&НаСервереБезКонтекста
Процедура СписокПриПолученииДанныхНаСервере(ИмяЭлемента, Настройки, Строки)
	//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ДоговорыКонтрагентов.Ссылка как Договор,
		|	ВЫБОР
		|		КОГДА ДоговорыКонтрагентовПрисоединенныеФайлы.Ссылка ЕСТЬ NULL
		|			ТОГДА ""Нет""
		|		ИНАЧЕ ""Да""
		|	КОНЕЦ КАК СканВерсия,
		|	ВЫБОР
		|		КОГДА ДоговорыКонтрагентовПрисоединенныеФайлыОригинал.Ссылка ЕСТЬ NULL
		|			ТОГДА ""Нет""
		|		ИНАЧЕ ""Да""
		|	КОНЕЦ КАК Оригинал,
		|	ВЫБОР
		|		КОГДА ДоговорыКонтрагентовПрисоединенныеФайлыДопСоглашение.Ссылка ЕСТЬ NULL
		|			ТОГДА ""Нет""
		|		ИНАЧЕ ""Да""
		|	КОНЕЦ КАК ДопСоглашение
		|ИЗ
		|	Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
		|		ЛЕВОЕ Соединение Справочник.ДоговорыКонтрагентовПрисоединенныеФайлы КАК ДоговорыКонтрагентовПрисоединенныеФайлы
		|		ПО ДоговорыКонтрагентовПрисоединенныеФайлы.ВладелецФайла = ДоговорыКонтрагентов.Ссылка
		|		И
		|			ДоговорыКонтрагентовПрисоединенныеФайлы.ТипЗагруженногоДокумента = ЗНАЧЕНИЕ(Перечисление.ТипыЗагруженныхДокументов.СканВерсия)
		|		И
		|			ДоговорыКонтрагентовПрисоединенныеФайлы.ВидЗагруженногоДокумента = ЗНАЧЕНИЕ(Перечисление.ВидыЗагруженныхДокументов.Договор)
		|		ЛЕВОЕ Соединение Справочник.ДоговорыКонтрагентовПрисоединенныеФайлы КАК
		|			ДоговорыКонтрагентовПрисоединенныеФайлыОригинал
		|		ПО ДоговорыКонтрагентовПрисоединенныеФайлыОригинал.ВладелецФайла = ДоговорыКонтрагентов.Ссылка
		|		И
		|			ДоговорыКонтрагентовПрисоединенныеФайлыОригинал.ТипЗагруженногоДокумента = ЗНАЧЕНИЕ(Перечисление.ТипыЗагруженныхДокументов.Оригинал)
		|		И
		|			ДоговорыКонтрагентовПрисоединенныеФайлыОригинал.ВидЗагруженногоДокумента = ЗНАЧЕНИЕ(Перечисление.ВидыЗагруженныхДокументов.Договор)
		|		ЛЕВОЕ Соединение Справочник.ДоговорыКонтрагентовПрисоединенныеФайлы КАК
		|			ДоговорыКонтрагентовПрисоединенныеФайлыДопСоглашение
		|		ПО ДоговорыКонтрагентовПрисоединенныеФайлыДопСоглашение.ВладелецФайла = ДоговорыКонтрагентов.Ссылка
		|		И
		|			ДоговорыКонтрагентовПрисоединенныеФайлыДопСоглашение.ВидЗагруженногоДокумента = ЗНАЧЕНИЕ(Перечисление.ВидыЗагруженныхДокументов.ДополнительноеСоглашение)
		|ГДЕ
		|	ДоговорыКонтрагентов.Ссылка В (&СписокДоговоров)";
	
	Запрос.УстановитьПараметр("СписокДоговоров", Строки.ПолучитьКлючи());
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		// Вставить обработку выборки ВыборкаДетальныеЗаписи
		СтрокаСписка=Строки[ВыборкаДетальныеЗаписи.Договор];
	СтрокаСписка.Данные.НаличиеСканВерсии =ВыборкаДетальныеЗаписи.СканВерсия;
	СтрокаСписка.Данные.НаличиеОригинала =ВыборкаДетальныеЗаписи.Оригинал;
	СтрокаСписка.Данные.НаличиеДС =ВыборкаДетальныеЗаписи.ДопСоглашение;
	КонецЦикла;
	
	//}}КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА

	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ДоговорыКонтрагентов.Ссылка КАК Договор,
		|	СУММА(РеестрДолжниковДолжники.СуммаЗадолженности) КАК ОбщаяСуммаЗадолженности,
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ РеестрДолжниковДолжники.Долг) КАК КоличествоПозиций,
		|	ВЫБОР
		|		КОГДА КОЛИЧЕСТВО(РАЗЛИЧНЫЕ РеестрДолжниковДолжники.Ссылка) > 0
		|			ТОГДА Истина
		|		ИНАЧЕ Ложь
		|	Конец КАК РеестрЗагружен
		|ИЗ
		|	Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РеестрДолжников.Должники КАК РеестрДолжниковДолжники
		|		ПО (РеестрДолжниковДолжники.Ссылка.Договор = ДоговорыКонтрагентов.Ссылка)
		|ГДЕ
		|	ДоговорыКонтрагентов.Ссылка В (&СписокДоговоров)
		|СГРУППИРОВАТЬ ПО
		|	ДоговорыКонтрагентов.Ссылка";
	
	Запрос.УстановитьПараметр("СписокДоговоров", Строки.ПолучитьКлючи());
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
				СтрокаСписка=Строки[ВыборкаДетальныеЗаписи.Договор];
				ЗаполнитьЗначенияСвойств(СтрокаСписка.Данные, ВыборкаДетальныеЗаписи);
//	СтрокаСписка.Данные.НаличиеСканВерсии =ВыборкаДетальныеЗаписи.СканВерсия;
//	СтрокаСписка.Данные.НаличиеОригинала =ВыборкаДетальныеЗаписи.Оригинал;
//	СтрокаСписка.Данные.НаличиеДС =ВыборкаДетальныеЗаписи.ДопСоглашение;
	КонецЦикла;
	
	//}}КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	
КонецПроцедуры

&НаКлиенте
Процедура НаличиеСканВерсииОбработкаНавигационнойСсылки(Элемент, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка)
	// Вставить содержимое обработчика.
	
КонецПроцедуры
